Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/Enums/ТипыПубликацийЭлектронныхРесурсовСУЗ/ТипыПубликацийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПубликацийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCORM_1_3</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаЭкспортаSCORM/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПолучитьПакетДанных()

	ДанныеУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Узел, "Наименование, Код, НомерВерсии, НомерРедакции, ДатаИзменения");
	
	СвойстваПакета = Новый Структура("Наименование, ИмяФайлаПакета, Код, Версия, КонтрольнаяСумма, АдресВоВременномХранилище, ДатаИзменения, Размер");
	
	СвойстваПакета.Наименование  = ДанныеУзла.Наименование;
	СвойстваПакета.Код           = Строка(ДанныеУзла.Код);
	СвойстваПакета.Версия        = Строка(ДанныеУзла.НомерРедакции) + "." + Строка(ДанныеУзла.НомерВерсии);
	СвойстваПакета.ДатаИзменения = ДанныеУзла.ДатаИзменения;
	
	ЭлементыДляЭкспорта = Новый ТаблицаЗначений();
	ЭлементыДляЭкспорта.Колонки.Добавить("СсылкаНаЭлемент");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменМатериаламиСУЗЭлементыДляЭкспорта.СсылкаНаЭлемент КАК СсылкаНаЭлемент
		|ИЗ
		|	ПланОбмена.ОбменМатериаламиСУЗ.ЭлементыДляЭкспорта КАК ОбменМатериаламиСУЗЭлементыДляЭкспорта
		|ГДЕ
		|	ОбменМатериаламиСУЗЭлементыДляЭкспорта.Ссылка = &Узел";
	
	Запрос.УстановитьПараметр("Узел", Параметры.Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ЭлементыДляЭкспорта.Добавить();
		НоваяСтрока.СсылкаНаЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлемент; 
	КонецЦикла;
	
	ОбработкаПубликации = Обработки.ПубликацияЭлектронныхРесурсовСУЗ.Создать();
	ОбработкаПубликации.ТипПубликации = перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3;
	
	ОбработкаПубликации.ОпубликоватьПакетДанных(СвойстваПакета, ЭлементыДляЭкспорта, УникальныйИдентификатор);
	
	//
	
	АдресПакетаДанных = СвойстваПакета.АдресВоВременномХранилище;
	Наименование      = """" + СвойстваПакета.ИмяФайлаПакета + """";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Узел) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пакет данных не задан.'"),,,,Отказ);
	КонецЕсли;
	
	ПолучитьПакетДанных();
	
	Если НЕ ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура СохранитьПакетДанных(Команда)
	
	Если ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		ИмяФайла = ОбщегоНазначенияСУКлиентСервер.ЗаменитьЗапрещенныеСимволыВИмениФайла(Наименование) + ".zip";
		ПолучитьФайл(АдресПакетаДанных, ИмяФайла, Истина);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
